uhnp/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ВыводитьНомераСтрок</name>
    <comment>// Юдина (Гутарова) Екатерина 25.09.2024 Выполнение задач №000050931</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НаименованиеЛистаУдалить</name>
    <comment>№000051650</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_СпециальнаяФормаВыгрузки</name>
    <comment>// Чекордина Ирина 15.08.2025 Выполнение задач №000054725</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_СпециальнаяФормаЗагрузки</name>
    <comment>// Белоконенко Денис 14.08.2025 Выполнение задач №000054780</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>тн_ИмяЛистовExcel</name>
    <comment>// Белоконенко Денис 20.10.2025 Выполнение задач №000055268</comment>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛиста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ВидыИтоговПоказателя/ВидыИтоговПоказателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИтоговПоказателя</name>
  <enumValues>
    <name>Минимум</name>
  </enumValues>
  <enumValues>
    <name>Максимум</name>
  </enumValues>
  <enumValues>
    <name>Среднее</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>НеРассчитывается</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СтрокиОтчетов/СтрокиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммироватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодавлятьИерархиюПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСправочникаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяУказываетсяВАналитике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСтатейДляУстановкиАналитикБДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСтатейДляУстановкиАналитикБДР</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатьи</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/БланкиОтчетов/Forms/СопоставлениеАналитическомуРаскрытию/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета				= Параметры.ВидОтчета;
	МакетОтчета				= Параметры.ТабличныйДокумент;
	ШиринаКолонкиПоОбласти	= Параметры.ФорматированиеКолонок;
	ВыделеннаяОбласть		= Параметры.Область;
	
	Данные = Новый Структура;
	
	ШириныКолонок = Новый Соответствие();
	НомераКолонок = Новый Соответствие();
	АдресаКолонок = Новый Соответствие();
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Точечная);
	
	НомерКолонки = 1;
	Для Каждого Колонка Из ШиринаКолонкиПоОбласти Цикл
		
		Область = ТабличныйДокумент.Область(1, Колонка.Ключ - (ВыделеннаяОбласть.Лево - 1), 1, Колонка.Ключ + Колонка.Значение - 1 - (ВыделеннаяОбласть.Лево - 1));
		Область.Обвести(Линия, Линия, Линия, Линия);
		Область.СодержитЗначение = Истина;
		Если Колонка.Значение > 1 Тогда
			Область.Объединить();
		КонецЕсли;
		Область.ЦветФона = Новый Цвет(255, 255, 192);
		
		НомераКолонок.Вставить(Область.Лево, НомерКолонки);
		ШириныКолонок.Вставить(НомерКолонки, Колонка.Значение);
		АдресаКолонок.Вставить(НомерКолонки, Область.Лево);
		
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
	ТабличныйДокумент.Присоединить(МакетОтчета.ПолучитьОбласть(ВыделеннаяОбласть.Верх, ВыделеннаяОбласть.Лево, ВыделеннаяОбласть.Низ, ВыделеннаяОбласть.Право));
	
	Пока ТабличныйДокумент.Области.Количество() Цикл
		ТабличныйДокумент.Области.Получить(0).Имя = "";
	КонецЦикла;
	
	Колонки = Новый Структура;
	Колонки.Вставить("ШириныКолонок", ШириныКолонок);
	Колонки.Вставить("НомераКолонок", НомераКолонок);
	Колонки.Вставить("АдресаКолонок", АдресаКолонок);
	
	Данные.Вставить("Колонки", Колонки);
	
	Данные.Вставить("Аналитики", Новый Соответствие);
	Данные.Вставить("ВыбранныеАналитики", Новый Соответствие);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаОтчетаПриИзменении(Элемент)
	
	ОбновитьАналитики();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	НомерКолонки = Данные.Колонки.НомераКолонок[Область.Лево];
	ШиринаКолонки = Данные.Колонки.ШириныКолонок[НомерКолонки];
	
	Если Область.Верх = 1 И Область.Низ = 1 И ШиринаКолонки = Область.Право - Область.Лево + 1 Тогда
		
		Если СтрокаОтчета.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "СтрокаОтчета";
			Сообщение.Текст = Нстр("ru = 'Не выбрана строка отчета'");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		СоответствиеЗначений = Новый Соответствие;
		
		Индекс = 0;
		
		ВыбраннаяАналитика = Данные.ВыбранныеАналитики.Получить(НомерКолонки);
		ТекущееЗначение = ?(ВыбраннаяАналитика = Неопределено, 1, Неопределено);
		
		Дерево = Новый Массив;
		
		Для Каждого Аналитика Из Данные.Аналитики Цикл
			
			ЗначениеАналитики = Аналитика.Значение;
			
			Индекс = Индекс + 1;
			СоответствиеЗначений.Вставить(Индекс, Новый Структура("Ключ,ИндексРеквизита", Аналитика.Ключ, Неопределено));
			
			Строки = Новый Массив;
			
			СтруктураСтроки = Новый Структура("Значение,Представление,Строки", Индекс, ЗначениеАналитики.Представление, Строки);
			Дерево.Добавить(СтруктураСтроки);
			
			Если ТекущееЗначение = Неопределено И ВыбраннаяАналитика.КодНомер = СокрП(ЗначениеАналитики.КодНомер) Тогда
				ТекущееЗначение = Индекс;
			КонецЕсли;
			
			Если НЕ ЗначениеАналитики.ЭтоАналитика Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Реквизит Из ЗначениеАналитики.Реквизиты Цикл
				
				Если ПустаяСтрока(Реквизит.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				Индекс = Индекс + 1;
				СоответствиеЗначений.Вставить(Индекс, Новый Структура("Ключ,ИндексРеквизита", Аналитика.Ключ, ЗначениеАналитики.Реквизиты.Индекс(Реквизит)));
				
				Строки.Добавить(Новый Структура("Значение,Представление,Строки", Индекс, Реквизит.Представление, Новый Массив));
				
				Если ТекущееЗначение = Неопределено И ВыбраннаяАналитика.Ссылка = ЗначениеАналитики.Ссылка И (ВыбраннаяАналитика.КодНомер = ЗначениеАналитики.КодНомер ИЛИ ВыбраннаяАналитика.КодНомер = СокрП(ЗначениеАналитики.КодНомер) + "_" + Реквизит.Значение) Тогда
					ТекущееЗначение = Индекс;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ВыбранноеЗначение = Неопределено;
		
		ПараметрыФормы = Новый Структура("Дерево,ТекущееЗначение", Дерево, ТекущееЗначение);
		ДопПараметры = Новый Структура("НомерКолонки, Область, СоответствиеЗначений", НомерКолонки, Область, СоответствиеЗначений);
		Оповещение = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.БланкиОтчетов.Форма.ФормаВыбораЗначенияИзДерева", 
						ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    НомерКолонки = ДополнительныеПараметры.НомерКолонки;
    Область = ДополнительныеПараметры.Область;
    СоответствиеЗначений = ДополнительныеПараметры.СоответствиеЗначений;
    
    
    ВыбранноеЗначение = Результат;
    Если НЕ ВыбранноеЗначение = Неопределено Тогда
        
        Аналитика = Данные.Аналитики[СоответствиеЗначений[ВыбранноеЗначение].Ключ];
        
        ОсновноеПредставление = "";
        
        ИндексРеквизита = СоответствиеЗначений[ВыбранноеЗначение].ИндексРеквизита;
        Если НЕ ИндексРеквизита = Неопределено Тогда
            Реквизит = Аналитика.Реквизиты.Получить(ИндексРеквизита);
            Текст = "[" + Аналитика.Представление + "][" + Реквизит.Представление + "]";
            КодНомер = СокрП(Аналитика.КодНомер) + "_" + Реквизит.Значение;
        Иначе
            Текст = Аналитика.Представление;
            КодНомер = СокрП(Аналитика.КодНомер);
            Если Аналитика.ЭтоАналитика Тогда
                ОсновноеПредставление = Аналитика.ОсновноеПредставление;
            КонецЕсли;
        КонецЕсли;
        
        Область.Значение = Текст;
		
		СтруктураАналитики = Новый Структура("ЭтоАналитика,Ссылка,КодНомер,Представление,ВидИтога,ОсновноеПредставление,ТипЗначения", 
											Аналитика.ЭтоАналитика, Аналитика.Ссылка, КодНомер, Текст, Аналитика.ВидИтога, ОсновноеПредставление, Аналитика.ТипЗначения);
		
        Данные.ВыбранныеАналитики.Вставить(НомерКолонки, СтруктураАналитики);
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьАналитики()
	
	Аналитики = Новый Соответствие;
	
	Если НЕ СтрокаОтчета.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
		Запрос.УстановитьПараметр("СтрокаОтчета", СтрокаОтчета);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтрокиОтчетов.Ссылка КАК Ссылка,
		|	СтрокиОтчетов.Код КАК Код,
		|	СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	СтрокиОтчетов.Наименование КАК Наименование
		|ПОМЕСТИТЬ СтрокаОтчета
		|ИЗ
		|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
		|ГДЕ
		|	СтрокиОтчетов.Ссылка = &СтрокаОтчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокаОтчета.Код КАК Код,
		|	СтрокаОтчета.Наименование КАК Наименование
		|ИЗ
		|	СтрокаОтчета КАК СтрокаОтчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыРаскрытия.ВидАналитики1 КАК ВидАналитики1,
		|	ГруппыРаскрытия.ВидАналитики2 КАК ВидАналитики2,
		|	ГруппыРаскрытия.ВидАналитики3 КАК ВидАналитики3,
		|	ГруппыРаскрытия.ВидАналитики4 КАК ВидАналитики4,
		|	ГруппыРаскрытия.ВидАналитики5 КАК ВидАналитики5,
		|	ГруппыРаскрытия.ВидАналитики6 КАК ВидАналитики6,
		|	ГруппыРаскрытия.ЧислоАналитик КАК ЧислоАналитик,
		|	ГруппыРаскрытия.ВидАналитики1.Наименование КАК ВидАналитики1Наименование,
		|	ГруппыРаскрытия.ВидАналитики2.Наименование КАК ВидАналитики2Наименование,
		|	ГруппыРаскрытия.ВидАналитики3.Наименование КАК ВидАналитики3Наименование,
		|	ГруппыРаскрытия.ВидАналитики4.Наименование КАК ВидАналитики4Наименование,
		|	ГруппыРаскрытия.ВидАналитики5.Наименование КАК ВидАналитики5Наименование,
		|	ГруппыРаскрытия.ВидАналитики6.Наименование КАК ВидАналитики6Наименование,
		|	ГруппыРаскрытия.Код КАК Код
		|ИЗ
		|	СтрокаОтчета КАК СтрокаОтчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия
		|		ПО СтрокаОтчета.ГруппаРаскрытия = ГруппыРаскрытия.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОтчетов.Ссылка КАК Ссылка,
		|	ПоказателиОтчетов.Код КАК Код,
		|	ПоказателиОтчетов.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА ПоказателиОтчетов.НеФинансовый
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИтоговПоказателя.НеРассчитывается)
		|		ИНАЧЕ ПоказателиОтчетов.ВидИтога
		|	КОНЕЦ КАК ВидИтога,
		|	ПоказателиОтчетов.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|ГДЕ
		|	НЕ ПоказателиОтчетов.ПометкаУдаления
		|	И ПоказателиОтчетов.Владелец = &ВидОтчета
		|	И ПоказателиОтчетов.Строка = &СтрокаОтчета";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выбрать();
		Если Выборка.Следующий() Тогда
			
			КодГруппы = СокрП(Выборка.Код);
		
			Для Номер = 1 По Выборка.ЧислоАналитик Цикл
				
				ВидАналитики = Выборка["ВидАналитики" + Номер];
				АналитикаНаименование = Выборка["ВидАналитики" + Номер + "Наименование"];
				
				Попытка // примитивные типы
					Тип = Новый(ТипЗнч(ВидАналитики));
					МД = Тип.Метаданные();
					ОсновноеПредставление = ?(МД.ОсновноеПредставление = Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСправочника.ВВидеКода, "Код", "Наименование");
				Исключение
					ОсновноеПредставление = "";
				КонецПопытки;
				
				Аналитики.Вставить(ВидАналитики, Новый Структура("ЭтоАналитика,Ссылка,КодНомер,Представление,Реквизиты,ВидИтога,ОсновноеПредставление,ТипЗначения", Истина, ВидАналитики, Номер, АналитикаНаименование, КэшируемыеПроцедурыУХ.ВернутьСписокРеквизитов(ВидАналитики), "", ОсновноеПредставление, Неопределено));
				
			КонецЦикла;
			
		Иначе
			
			КодГруппы = "";
			
		КонецЕсли;
		
		Выборка = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
		Пока Выборка.Следующий() Цикл 
		
			Аналитики.Вставить(Выборка.Ссылка, Новый Структура("ЭтоАналитика,Ссылка,КодНомер,Представление,Реквизиты,ВидИтога,ТипЗначения", Ложь, Выборка.Ссылка, Выборка.Код, Выборка.Наименование, Неопределено, Выборка.ВидИтога, Выборка.ТипЗначения));
			
		КонецЦикла;
		
		Выборка = РезультатЗапроса[РезультатЗапроса.Количество() - 3].Выбрать();
		Выборка.Следующий();
		КодСтроки = СокрП(Выборка.Код);
		НаименованиеСтроки = Выборка.Наименование;
		
	КонецЕсли;
	
	Данные.Аналитики = Аналитики;
	
	ВыбранныеАналитики = Новый Соответствие;
	Для Каждого ВыбраннаяАналитика Из Данные.ВыбранныеАналитики Цикл
		
		Если НЕ ВыбраннаяАналитика.ЭтоАналитика ИЛИ Аналитики.Получить(ВыбраннаяАналитика.Значение.Ссылка) = Неопределено Тогда
			
			ТабличныйДокумент.Область(1, Данные.Колонки.АдресаКолонок.Получить(ВыбраннаяАналитика.Ключ)).Значение = "";
			
		Иначе
			
			ВыбранныеАналитики.Вставить(ВыбраннаяАналитика.Ключ, ВыбраннаяАналитика.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Данные.ВыбранныеАналитики = ВыбранныеАналитики;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	Закрыть(СформироватьРезультатСопоставления());
	
КонецПроцедуры

&НаСервере
Функция СформироватьРезультатСопоставления()
	
	Колонки = Новый Массив;
	
	Если НЕ СтрокаОтчета.Пустая() Тогда
		
		Для Каждого ВыбраннаяАналитика Из Данные.ВыбранныеАналитики Цикл
			
			Аналитика = ВыбраннаяАналитика.Значение;
			
			Если НЕ ПустаяСтрока(Аналитика.ОсновноеПредставление) Тогда
				КодНомер = Аналитика.КодНомер + "_" + Аналитика.ОсновноеПредставление;
			Иначе
				КодНомер = Аналитика.КодНомер;
			КонецЕсли;
			
			Колонки.Добавить(Новый Структура("Адрес,ЭтоАналитика,Код,Представление,ВидИтога,ТипЗначения", Данные.Колонки.АдресаКолонок[ВыбраннаяАналитика.Ключ], Аналитика.ЭтоАналитика, КодНомер, Аналитика.Представление, Аналитика.ВидИтога, Аналитика.ТипЗначения));
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Новый Структура("КодСтроки,НаименованиеСтроки,КодГруппы,Колонки", КодСтроки, НаименованиеСтроки, КодГруппы, Колонки);	
	
КонецФункции


&НаКлиенте
Процедура ВысотаОбластиЗаголовкаПриИзменении(Элемент)
	
	ВысотаОбластиЗаголовка = ИзменитьВысотуОбласти(, ВысотаОбластиЗаголовка, "Заголовок");
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаОбластиЗаголовкаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВысотаОбластиЗаголовка = ИзменитьВысотуОбласти(ВысотаОбластиЗаголовка, ВысотаОбластиЗаголовка + Направление, "Заголовок");
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаОбластиИтоговПриИзменении(Элемент)
	
	ВысотаОбластиИтогов = ИзменитьВысотуОбласти(, ВысотаОбластиИтогов, "Итоги");
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаОбластиИтоговРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВысотаОбластиИтогов = ИзменитьВысотуОбласти(ВысотаОбластиИтогов, ВысотаОбластиИтогов + Направление, "Итоги");
	
КонецПроцедуры

&НаКлиенте
Функция ИзменитьВысотуОбласти(ТекущаяВысота = Неопределено, НоваяВысота, ИмяОбласти)
	
	Если НоваяВысота <= 0 Тогда
		Элементы.ТабличныйДокумент.ТекущаяОбласть = Неопределено;
		Возврат 0;
	КонецЕсли;
	
	Если ТекущаяВысота = Неопределено Тогда
		Область = ТабличныйДокумент.Области.Найти(ИмяОбласти);
		Если Область = Неопределено Тогда
			Если ИмяОбласти = "Заголовок" Тогда
				Верх = 2;
				Низ = Верх - 1;
			Иначе
				Низ = ТабличныйДокумент.ВысотаТаблицы;
				Верх = Низ + 1;
			КонецЕсли;
		Иначе
			Верх = Область.Верх;
			Низ = Область.Низ;
		КонецЕсли;
		ТекущаяВысота = Низ - Верх + 1;
	ИначеЕсли ТекущаяВысота = 0 Тогда
		Если ИмяОбласти = "Заголовок" Тогда
			Верх = 2;
			Низ = Верх - 1;
		Иначе
			Низ = ТабличныйДокумент.ВысотаТаблицы;
			Верх = Низ + 1;
		КонецЕсли;
	Иначе
		Если ИмяОбласти = "Заголовок" Тогда
			Верх = 2;
			Низ = Верх + ТекущаяВысота - 1;
		Иначе
			Низ = ТабличныйДокумент.ВысотаТаблицы;
			Верх = Низ - ТекущаяВысота + 1;
		КонецЕсли;
	КонецЕсли;
	
	Если НоваяВысота > ТекущаяВысота Тогда
		
		ИспользуемаяВысота = 1;
		Для Индекс = 0 По ТабличныйДокумент.Области.Количество() - 1 Цикл
			Область_ = ТабличныйДокумент.Области.Получить(Индекс);
			ИспользуемаяВысота = ИспользуемаяВысота + Область_.Низ - Область_.Верх + 1;
		КонецЦикла;
		
		Если ИспользуемаяВысота = ТабличныйДокумент.ВысотаТаблицы Тогда
			Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Области.Найти(ИмяОбласти);
			Возврат ТекущаяВысота;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяОбласти = "Заголовок" Тогда
		Низ = Верх + НоваяВысота - 1;
	Иначе
		Верх = Низ - НоваяВысота + 1;
	КонецЕсли;
	
	Область = ТабличныйДокумент.Области.Найти(ИмяОбласти);
	Если НЕ Область = Неопределено Тогда
		Область.Имя = "";
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(Верх, 1, Низ, ТабличныйДокумент.ШиринаТаблицы);
	Область.Имя = ИмяОбласти;
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = Область;
	
	Возврат НоваяВысота;
	
КонецФункции
